; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob5656) (:domain Depot)
(:objects
	depot0 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate11)
	(at pallet1 distributor0)
	(clear crate14)
	(at pallet2 distributor1)
	(clear crate10)
	(at truck0 distributor1)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor1)
	(on crate0 pallet2)
	(at crate1 depot0)
	(on crate1 pallet0)
	(at crate2 distributor1)
	(on crate2 crate0)
	(at crate3 distributor0)
	(on crate3 pallet1)
	(at crate4 distributor0)
	(on crate4 crate3)
	(at crate5 distributor1)
	(on crate5 crate2)
	(at crate6 depot0)
	(on crate6 crate1)
	(at crate7 distributor0)
	(on crate7 crate4)
	(at crate8 distributor0)
	(on crate8 crate7)
	(at crate9 distributor0)
	(on crate9 crate8)
	(at crate10 distributor1)
	(on crate10 crate5)
	(at crate11 depot0)
	(on crate11 crate6)
	(at crate12 distributor0)
	(on crate12 crate9)
	(at crate13 distributor0)
	(on crate13 crate12)
	(at crate14 distributor0)
	(on crate14 crate13)
)

(:goal (and
		(on crate0 crate8)
		(on crate1 crate9)
		(on crate2 crate1)
		(on crate3 crate12)
		(on crate4 crate11)
		(on crate5 crate0)
		(on crate8 pallet0)
		(on crate9 pallet1)
		(on crate10 crate4)
		(on crate11 crate5)
		(on crate12 pallet2)
	)
)(:metric minimize (total-time)))

; plan
1. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 11
2. (lift hoist1 crate14 crate13 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist1) (on crate14 crate13)
   added: (lifting hoist1 crate14) (clear crate13)
   goals met: 0 of 11
3. (load hoist1 crate14 truck0 distributor0)
   deleted: (lifting hoist1 crate14)
   added: (in crate14 truck0) (available hoist1)
   goals met: 0 of 11
4. (lift hoist1 crate13 crate12 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist1) (on crate13 crate12)
   added: (lifting hoist1 crate13) (clear crate12)
   goals met: 0 of 11
5. (load hoist1 crate13 truck0 distributor0)
   deleted: (lifting hoist1 crate13)
   added: (in crate13 truck0) (available hoist1)
   goals met: 0 of 11
6. (lift hoist1 crate12 crate9 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist1) (on crate12 crate9)
   added: (lifting hoist1 crate12) (clear crate9)
   goals met: 0 of 11
7. (load hoist1 crate12 truck0 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck0) (available hoist1)
   goals met: 0 of 11
8. (lift hoist1 crate9 crate8 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate8)
   added: (lifting hoist1 crate9) (clear crate8)
   goals met: 0 of 11
9. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   goals met: 0 of 11
10. (lift hoist1 crate8 crate7 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate7)
   added: (lifting hoist1 crate8) (clear crate7)
   goals met: 0 of 11
11. (load hoist1 crate8 truck0 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 0 of 11
12. (lift hoist1 crate7 crate4 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist1) (on crate7 crate4)
   added: (lifting hoist1 crate7) (clear crate4)
   goals met: 0 of 11
13. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 0 of 11
14. (lift hoist1 crate4 crate3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   goals met: 0 of 11
15. (load hoist1 crate4 truck0 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 0 of 11
16. (lift hoist1 crate3 pallet1 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 pallet1)
   added: (lifting hoist1 crate3) (clear pallet1)
   goals met: 0 of 11
17. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 0 of 11
18. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   goals met: 0 of 11
19. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 0 of 11
20. (lift hoist0 crate11 crate6 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate6)
   added: (lifting hoist0 crate11) (clear crate6)
   goals met: 0 of 11
21. (load hoist0 crate11 truck0 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck0) (available hoist0)
   goals met: 0 of 11
22. (lift hoist0 crate6 crate1 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate1)
   added: (lifting hoist0 crate6) (clear crate1)
   goals met: 0 of 11
23. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 0 of 11
24. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   goals met: 0 of 11
25. (load hoist0 crate1 truck1 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck1) (available hoist0)
   goals met: 0 of 11
26. (unload hoist0 crate8 truck0 depot0)
   deleted: (in crate8 truck0) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 0 of 11
27. (drop hoist0 crate8 pallet0 depot0)
   deleted: (lifting hoist0 crate8) (clear pallet0)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 pallet0)
   goals met: 1 of 11
28. (drop hoist1 crate9 pallet1 distributor0)
   deleted: (lifting hoist1 crate9) (clear pallet1)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 pallet1)
   goals met: 2 of 11
29. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 2 of 11
30. (lift hoist2 crate10 crate5 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist2) (on crate10 crate5)
   added: (lifting hoist2 crate10) (clear crate5)
   goals met: 2 of 11
31. (load hoist2 crate10 truck0 distributor1)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   goals met: 2 of 11
32. (lift hoist2 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate2)
   added: (lifting hoist2 crate5) (clear crate2)
   goals met: 2 of 11
33. (load hoist2 crate5 truck0 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck0) (available hoist2)
   goals met: 2 of 11
34. (lift hoist2 crate2 crate0 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   goals met: 2 of 11
35. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   goals met: 2 of 11
36. (lift hoist2 crate0 pallet2 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist2) (on crate0 pallet2)
   added: (lifting hoist2 crate0) (clear pallet2)
   goals met: 2 of 11
37. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   goals met: 2 of 11
38. (unload hoist2 crate12 truck0 distributor1)
   deleted: (in crate12 truck0) (available hoist2)
   added: (lifting hoist2 crate12)
   goals met: 2 of 11
39. (drop hoist2 crate12 pallet2 distributor1)
   deleted: (lifting hoist2 crate12) (clear pallet2)
   added: (available hoist2) (at crate12 distributor1) (clear crate12) (on crate12 pallet2)
   goals met: 3 of 11
40. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 3 of 11
41. (drop hoist2 crate3 crate12 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate12)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate12)
   goals met: 4 of 11
42. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 4 of 11
43. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 4 of 11
44. (drop hoist0 crate0 crate8 depot0)
   deleted: (lifting hoist0 crate0) (clear crate8)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate8)
   goals met: 5 of 11
45. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 5 of 11
46. (drop hoist0 crate5 crate0 depot0)
   deleted: (lifting hoist0 crate5) (clear crate0)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate0)
   goals met: 6 of 11
47. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 6 of 11
48. (drop hoist0 crate11 crate5 depot0)
   deleted: (lifting hoist0 crate11) (clear crate5)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate5)
   goals met: 7 of 11
49. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 7 of 11
50. (drop hoist0 crate4 crate11 depot0)
   deleted: (lifting hoist0 crate4) (clear crate11)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate11)
   goals met: 8 of 11
51. (unload hoist0 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist0)
   added: (lifting hoist0 crate10)
   goals met: 8 of 11
52. (drop hoist0 crate10 crate4 depot0)
   deleted: (lifting hoist0 crate10) (clear crate4)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 crate4)
   goals met: 9 of 11
53. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 9 of 11
54. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 9 of 11
55. (drop hoist1 crate1 crate9 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate9)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate9)
   goals met: 10 of 11
56. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 10 of 11
57. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 10 of 11
58. (drop hoist1 crate2 crate1 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate1)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate1)
   goals met: 11 of 11
